app/views/positions/_position_row.html.erb

    <th class="name_pos"><%= t('positions.position_row.position_name') %></th>
    <th><%= t('positions.position_row.group') %></th>
---
SELECT "positions".* FROM "positions"