app/views/wrapper/content-page/content/_navbar-custom.html.erb


                    <span class="account-position"><%= current_user.group.name if current_user.group %><% if current_user.departments.any? %>-<%= current_user.departments.first.name %><% end %></span>
---
SELECT "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT 1 AS one FROM "departments" INNER JOIN "user_departments" ON "departments"."id" = "user_departments"."department_id" WHERE "user_departments"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]