app/views/gi_accounts/_select_weapon.html.erb

                <% @weapons.each.with_index do |w, idx| %>
                    <% unless f.object.list_weapon.blank?  %>
---
SELECT `weapons`.* FROM `weapons`