app/views/users/_new_user.html.erb

SELECT "groups".* FROM "groups"
---

					<%if current_user.group_id != 1 %>

SELECT "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
					<div class="col-sm-2 text-end label-form">
							<%= f.label :group_id, t('users.new_user.group'), class: "control-label style-label" %><span class="required">*</span>

SELECT "groups".* FROM "groups"
---
						<div class="col-sm-4">
							<%= f.collection_select(:group_id, Group.all, :id, :name, {:prompt=>""}, {:class=>'form-control'}) %>