app/views/users/_user_row.html.erb

      <th><%= t('users.user_row.number') %></th>
      <th><%= t('users.user_row.group') %></th>
---
SELECT "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT `users`.* FROM `users`

        <td class="col_number"><%= index + 1 %></td>
        <td class="col_general"><%= user.group.name if user.group %></td>
---
SELECT "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

        <td class="col_name"><%= user.fullname %></td>
        <td class="col_group"><% user.departments.each do |department| %>
---
SELECT "departments".* FROM "departments" INNER JOIN "user_departments" ON "departments"."id" = "user_departments"."department_id" WHERE "user_departments"."user_id" = ?  [["user_id", 1]]

        <td class="col_general">
          <%= select_tag "position", options_for_select(user.positions.collect{|p| [p.name, p.id]}), class:'form-control' %>
---
SELECT "positions".* FROM "positions" INNER JOIN "user_positions" ON "positions"."id" = "user_positions"."position_id" WHERE "user_positions"."user_id" = ?  [["user_id", 1]]