app/views/departments/_department_row.html.erb

            <th class="name_depart"> <%= t('departments.department_row.department_name') %></th>
            <th class=""><%= t('departments.department_row.group') %></th>
---
SELECT "departments".* FROM "departments"
SELECT "groups".* FROM "groups" WHERE "groups"."id" = ?  [["id", 1]]