app/helpers/gi_accounts_helper.rb

    def render_list_char(list_char)
        list_char = list_char.tr('[]', '').split(',').map(&:strip)
        character_info = list_char.map do |info|
          character_id, constellation = info.split('_')
          character = Charater.find_by(id: character_id)
          if character.present?
---
SELECT `charaters`.* FROM `charaters`