app/helpers/gi_accounts_helper.rb

SELECT `charaters`.`name` FROM `charaters` WHERE `charaters`.`id` IN (2, 12)
---
    def render_list_char(list_char)
        list_char = list_char.tr('[]', '').split(',').map(&:strip)
        character_info = list_char.map do |info|
          character_id, constellation = info.split('_')
          character_name = Charater.find(character_id).name

SELECT `weapons`.`name` FROM `weapons` WHERE `weapons`.`id` = 1
---
      def render_list_weap(list_weap)
        list_weap = list_weap.tr('[]', '').split(',').map(&:strip)
        weapon_info = list_weap.map do |info|
          weapon_id, refinement = info.split('_')
          weapon_name = Weapon.find(weapon_id).name