app/controllers/charaters_controller.rb

  def index
    @charaters = Charater.all
---
SELECT `charaters`.* FROM `charaters`

  def create
    @charater = Charater.new(charater_params)
    @charaters = Charater.all
      if @charater.save
---
SELECT `charaters`.* FROM `charaters`
INSERT INTO `charaters` (`name`, `image_name`, `image_path`, `start`, `status`, `note`, `created_at`, `updated_at`, `role`) VALUES ('Amber', NULL, '2020031016592515874.png', 4, NULL, '', '2023-01-10 18:20:11.274785', '2023-01-10 18:20:11.274785', 2)

  def update
    @charaters = Charater.all
    if @charater.update(charater_params)
---
SELECT `charaters`.* FROM `charaters`
UPDATE `charaters` SET `charaters`.`updated_at` = '2023-01-10 15:46:22.409081', `charaters`.`role` = 1 WHERE `charaters`.`id` = 2

  def destroy
    @charater.destroy
---
DELETE FROM `charaters` WHERE `charaters`.`id` = 6

    def set_charater
      @charater = Charater.find(params[:id])
---
SELECT `charaters`.* FROM `charaters` WHERE `charaters`.`id` = 2 LIMIT 1