app/controllers/departments_controller.rb

SELECT "departments".* FROM "departments"
SELECT "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "positions".* FROM "positions"
---
  def index
      if current_user.group_id == 1
          @departments = Department.includes(:group).all
      else
          @departments = Department.includes(:group).where(group_id: current_user.group_id)
      end

      if current_user.group_id == 1
          @positions = Position.includes(:group).all

SELECT "departments".* FROM "departments"
SELECT "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "departments" ("name", "group_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "New 1"], ["group_id", 1], ["created_at", "2022-12-05 13:23:32.681960"], ["updated_at", "2022-12-05 13:23:32.681960"]]
---
  def create
      if current_user.group_id == 1
          @departments = Department.includes(:group).all
      else
          @departments = Department.includes(:group).where(group_id: current_user.group_id)
      end

      @department = Department.new(department_params)
      @department.group_id = current_user.group_id

      respond_to do |format|
          if @department.save