app/controllers/gi_accounts_controller.rb

  def index
    @gi_accounts = GiAccount.all
---
SELECT `gi_accounts`.* FROM `gi_accounts`

  def show
    @charaters = Charater.all
    @weapons = Weapon.all
---
SELECT `charaters`.* FROM `charaters`
SELECT `weapons`.* FROM `weapons`

  def new
    @gi_account = GiAccount.new
    @charaters = Charater.all
    @weapons = Weapon.all
---
SELECT `charaters`.* FROM `charaters`
SELECT `weapons`.* FROM `weapons`

  def edit
    @charaters = Charater.all
    @weapons = Weapon.all
---
SELECT `charaters`.* FROM `charaters`
SELECT `weapons`.* FROM `weapons`

  def create
    @gi_account = GiAccount.new(gi_account_params)
    @gi_accounts = GiAccount.all
      if @gi_account.save
---
SELECT `gi_accounts`.* FROM `gi_accounts`
INSERT INTO `gi_accounts` (`account_mail`, `account_pass`, `account_phone`, `status`, `note`, `price`, `owner`, `created_at`, `updated_at`, `list_character`, `list_weapon`, `birthday_acc`, `intertwined_fate`, `acquaint_fate`, `map_clear`, `account_code`, `role`, `sold_price`) VALUES ('newmail@gmail.com', '123456', '', NULL, NULL, 120000, NULL, '2023-01-13 19:43:34.677581', '2023-01-13 19:43:34.677581', '2', '', '', '', '', '', '', NULL, NULL)

  def update
    @gi_accounts = GiAccount.all
      if @gi_account.update(gi_account_params)
---
SELECT `gi_accounts`.* FROM `gi_accounts`
UPDATE `gi_accounts` SET `gi_accounts`.`account_mail` = 'adsfqwerqwer', `gi_accounts`.`updated_at` = '2023-01-13 19:37:17.226268' WHERE `gi_accounts`.`id` = 1

  def destroy
    @gi_account.destroy
---
DELETE FROM "gi_accounts" WHERE "gi_accounts"."id" = ?  [["id", 1]]

  def delete_accounts
    @accounts = GiAccount.where(id: params[:data][:ids])
---
SELECT `gi_accounts`.* FROM `gi_accounts` WHERE `gi_accounts`.`id` = 4 LIMIT 1

    def set_gi_account
      @gi_account = GiAccount.find(params[:id])
---
SELECT "gi_accounts".* FROM "gi_accounts" WHERE "gi_accounts"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]