app/controllers/users_controller.rb

SELECT "groups".* FROM "groups"
SELECT "departments".* FROM "departments"
SELECT "positions".* FROM "positions"
SELECT "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def new
    if current_user.group_id == 1
      @departments = Department.all
      @positions = Position.all
    else
      @departments = Department.where(group_id: current_user.group_id)
      @positions = Position.where(group_id: current_user.group_id)
    end
    @group = Group.find(current_user.group_id)

SELECT `users`.* FROM `users` WHERE `users`.`id` = NULL LIMIT 1
---
  def add_user
    if current_user.group_id == 1
      @departments = Department.all
      @positions = Position.all
    else
      @departments = Department.where(group_id: current_user.group_id)
      @positions = Position.where(group_id: current_user.group_id)
    end

    if current_user.group_id == 1
      @users = User.includes(:group, :user_departments, :departments,:user_positions, :positions).all
    else current_user.admin
      @users = User.includes(:group, :user_departments, :departments,:user_positions, :positions).where(group_id: current_user.group_id)
    end
    binding.pry
    @user = User.new(user_params)
    binding.pry
    @user.password_confirmation="123456"
    @user.password="123456"
    @user.status=0
    @user.group_id = current_user.group_id

SELECT `departments`.* FROM `departments` INNER JOIN user_departments ON user_departments.department_id=departments.id WHERE (user_departments.user_id='2')
SELECT `positions`.* FROM `positions` INNER JOIN user_positions ON user_positions.position_id=positions.id WHERE (user_positions.user_id='2')
---
  def edit_avatar
    @department = Department.joins("INNER JOIN user_departments ON user_departments.department_id=departments.id").where("user_departments.user_id=?", current_user.id)
    @list_department = @department.map { |p| p.name }.join("\n")
    @position = Position.joins("INNER JOIN user_positions ON user_positions.position_id=positions.id").where("user_positions.user_id=?", current_user.id)
    @list_position = @position.map { |p| p.name }.join("\n")