app/controllers/weapons_controller.rb

  def index
    @weapons = Weapon.all
---
SELECT `weapons`.* FROM `weapons`

  def create
    @weapon = Weapon.new(weapon_params)
    @weapons = Weapon.all
      if @weapon.save
---
SELECT `weapons`.* FROM `weapons`
INSERT INTO `weapons` (`name`, `stars`, `image_name`, `image_path`, `status`, `note`, `created_at`, `updated_at`, `vi_weapon_name`) VALUES ('asdf', 2, NULL, NULL, NULL, '', '2023-01-10 17:59:55.119293', '2023-01-10 17:59:55.119293', 'dsaf')

  def update
    @weapons = Weapon.all
    if @weapon.update(weapon_params)
---
SELECT `weapons`.* FROM `weapons`
UPDATE `weapons` SET `weapons`.`image_path` = '2020031016592515874.png', `weapons`.`updated_at` = '2023-01-13 20:02:20.948285' WHERE `weapons`.`id` = 3

    def set_weapon
      @weapon = Weapon.find(params[:id])
---
SELECT `weapons`.* FROM `weapons` WHERE `weapons`.`id` = 3 LIMIT 1