app/models/department.rb

SELECT "departments".* FROM "departments" WHERE "departments"."name" = ? AND "departments"."group_id" = ? LIMIT ?  [["name", "New 1"], ["group_id", 1], ["LIMIT", 1]]
---
  def ensure_department_exists
    @u = Department.find_by(name: self.name,group_id: self.group_id)