app/models/user.rb

SELECT "users".* FROM "users" WHERE "users"."employee_code" = ? AND "users"."group_id" = ? LIMIT ?  [["employee_code", "000001"], ["group_id", 1], ["LIMIT", 1]]
---
	def ensure_employee_code_exists
		@u = User.find_by(employee_code: self.employee_code,group_id: self.group_id)