app/controllers/users/registrations_controller.rb

SELECT `users`.* FROM `users`
SELECT MAX(`users`.`employee_code`) FROM `users`
INSERT INTO "groups" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Admin"], ["created_at", "2022-11-09 13:40:50.314257"], ["updated_at", "2022-11-09 13:40:50.314257"]]
---
  def create
    build_resource(sign_up_params)
    resource.admin = 1
    resource.active = 0
    resource.status = 1
    if User.maximum(:employee_code).nil?
      resource.employee_code = "1".rjust(6,"0")
    else
      code = User.maximum(:employee_code).to_i.next
      resource.employee_code = code.to_s.rjust(6,"0")
    end

    @group = Group.new
    @group.name = 'Admin'
    @group.save

DELETE FROM `groups` WHERE `groups`.`id` = 2
---
          respond_with resource, :location => after_inactive_sign_up_path_for(resource)
        end
      else
        @group.destroy