app/controllers/users/sessions_controller.rb

  def create
    @user = User.find_by(email: params[:user][:email])
        if @user
            password_user_encrypt = BCrypt::Password.new(@user.encrypted_password)
            password_input = params[:user][:password]
            if @user.active and @user.status
                super
                # ActionCable.server.broadcast("notification_channel_#{@user.id}", "logout")
            elsif @user.active and !@user.status && password_user_encrypt == password_input
                raw_token, hashed_token = Devise.token_generator.generate(User, :reset_password_token)
                # @user.reset_password_token = hashed_token
                # @user.reset_password_sent_at = Time.now.utc
                # @user.save!
                @user.update_columns(reset_password_token: hashed_token,reset_password_sent_at: Time.now.utc)
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "yusakithejoker@gmail.com"], ["LIMIT", 1]]
UPDATE `users` SET `users`.`updated_at` = '2022-12-31 09:20:07.147256', `users`.`sign_in_count` = 1, `users`.`current_sign_in_at` = '2022-12-31 09:20:07.147007', `users`.`last_sign_in_at` = '2022-12-31 09:20:07.147007', `users`.`current_sign_in_ip` = '::1', `users`.`last_sign_in_ip` = '::1' WHERE `users`.`id` = 1